tutorials/multiRegion/film/cylinderDripping/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    film
    {
        type            coupledTemperature;
        value           $internalField;
    }

    "(sides|frontAndBack)"
    {
        type            fixedValue;
        value           uniform 300;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
}

// ************************************************************************* //
